requestslib/soapmsg.xml

<?xml version='1.0' encoding='utf-8'?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/"><soap-env:Body><ns0:createRecord xmlns:ns0="http://ws.catalog.prosur.org/"><ipRecord xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns0:distinctiveSign"><applicantName>Juan Maria Chipugsi</applicantName><applicantName>Bill Gates</applicantName><applicationId>1706136665488629998</applicationId><files><fileDescription>test-description</fileDescription><fileName>test-file</fileName><fileTitle>test-title</fileTitle></files><ipRecordDetailLink>http://www.example.com</ipRecordDetailLink><ipRecordFilesService>http://192.168.1.37:8080/ProsurOfficeWS/IPOfficeWS</ipRecordFilesService><ipRecordId>3302</ipRecordId><nationalPresentationDate>2017-12-12</nationalPresentationDate><nationalPublishingDate>2017-12-12</nationalPublishingDate><onapiId>PY</onapiId><recordType>DISTINCTIVE_SIGN</recordType><statusId>EN_TRAMITE</statusId><title>Dummy Title</title><distinctiveSignType>MARCA</distinctiveSignType><expiration>2021-06-20-03:00</expiration><logoDescription>lorem ipsum consequat imperdiet duis</logoDescription><niceClasses><activity>anti-dazzle anti-splash</activity><niceClass>11</niceClass></niceClasses><registrationDate>2005-05-26</registrationDate></ipRecord><user>ecu_usr</user></ns0:createRecord></soap-env:Body></soap-env:Envelope>
